x = 5
y = 6

print(f'Побитовое "И" над числами {x} и {y} равно {x & y}')
print(f'Побитовое "ИЛИ" над числами {x} и {y} равно {x | y}')
print(f'Побитовый сдвиг вправо на два знака над числом {x} равен {x >> 2}')
print(f'Побитовый сдвиг влево на два знака над числом {x} равен {x << 2}')


"""
x = 5 = 101
y = 6 = 110

Побитовое 'И' (1Х1 = 1, 1Х0 = 0, 0Х0 = 0)
res = 100 = 4

Побитовое 'ИЛИ' (1Х1 = 1, 1Х0 = 1, 0Х0 = 0)
res = 111 = 7

Побитовое сдвиг вправо на 2 знака числа 5: 101 --> 001. Сдвигаем биты вправо на 2 позиции 
res = 001 = 1

Побитовое сдвиг вправо на 2 знака числа 5: 101 --> 10100. Сдвигаем биты влево на 2 позиции 
res = 10100 = 20
"""